In [47]:
import pandas as pd 
import numpy as np

In [48]:
dates = pd.date_range('20130101', periods=6)
df1 = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['A', 'B', 'C', 'D'])
df1

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

+ 选取列 --------------- df['A'] 或者 df.A

In [49]:
df1['A'],df1.A

(2013-01-01     0
 2013-01-02     4
 2013-01-03     8
 2013-01-04    12
 2013-01-05    16
 2013-01-06    20
 Freq: D, Name: A, dtype: int32,
 2013-01-01     0
 2013-01-02     4
 2013-01-03     8
 2013-01-04    12
 2013-01-05    16
 2013-01-06    20
 Freq: D, Name: A, dtype: int32)

+ 选取行

In [50]:
df1[0:3]

            A  B   C   D
2013-01-01  0  1   2   3
2013-01-02  4  5   6   7
2013-01-03  8  9  10  11

In [51]:
df1['20130104':'20130106']

             A   B   C   D
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

+ 根据标签进行选择 ========== 标签就是 'A', 'B', 'C', 'D', '2013-01-01'等

In [52]:
df1.loc[ : ,['A','D']]

             A   D
2013-01-01   0   3
2013-01-02   4   7
2013-01-03   8  11
2013-01-04  12  15
2013-01-05  16  19
2013-01-06  20  23

In [53]:
df1.loc[['20130101','20130103'],['A','C']]

            A   C
2013-01-01  0   2
2013-01-03  8  10

+ 根据 标签 & 位置 进行选择 ========== df.iloc[ : , : ]

In [54]:
df1.iloc[0:2,0:2]

            A  B
2013-01-01  0  1
2013-01-02  4  5

In [55]:
df1.iloc[[1,3,5],[1,3]]

             B   D
2013-01-02   5   7
2013-01-04  13  15
2013-01-06  21  23

In [56]:
df1.loc[:,['B','D']]

             B   D
2013-01-01   1   3
2013-01-02   5   7
2013-01-03   9  11
2013-01-04  13  15
2013-01-05  17  19
2013-01-06  21  23

### 判断筛选法
先挑选A的值大于等于8的 再挑出所有满足条件的行

In [57]:
df1[df1.A >= 8]  # 先挑选A的值大于等于8的 再挑出所有满足条件的行

             A   B   C   D
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23